    {
        "name": "Example Trade List",
        "^name^": "This is the name of the trade list.",

        "professions": [
            {
                "name": "sorcerer",
                "^name^": "This is the name of the Pigtificate profession. Acceptable values are: leader, forager, blacksmith, and sorcerer.",

                "careers": [
                    {
                        "name": "enchanter",
                        "^name^": [
                            "This is the name of the Pigtificate career.",
                            "Acceptable values for the leader profession are: chief.",
                            "Acceptable values for the forager profession are: hunter, gatherer, and scavenger.",
                            "Acceptable values for the blacksmith profession are: armorsmith, and toolsmith.",
                            "Acceptable values for the sorcerer profession are: enchanter, and brewer."
                        ],

                        "trades": [
                            {
                                "output": {
                                    "itemId": "minecraft:enchanted_book",
                                    "^itemId^": "This is the id name the item is registered with.",

                                    "meta": 0,

                                    "minStackSize": 1,
                                    "^minStackSize^": "This is the minimum number of items that may be output.",

                                    "maxStackSize": 1,
                                    "^maxStackSize^": "This is the maximum number of items that may be output.",

                                    "display": {
                                        "name": "Enchanted Book of Mending!",
                                        "^name^": "This is the name that will be applied to the item. This is optional.",

                                        "lore": [
                                            "An enchanted book.",
                                            "Imbued with magic!",
                                            "^loreText^ This is the text that the lore is comprised of."
                                        ],
                                        "^lore^": "This is the list of lore that will be applied to the item."

                                    },
                                    "^display^": "This is used to change the name of the item and add lore to it. This is optional.",

                                    "enchantments": [
                                        {
                                            "enchantmentId": "minecraft:mending",
                                            "^enchantmentId^": "This is the id name the enchantment is registered with.",

                                            "minLevel": 1,
                                            "^minLevel^": "This is the minimum level of enchantment that may be applied to the item.",

                                            "maxLevel": 3,
                                            "^maxLevel^": "This is the maximum level of enchantment that may be applied to the item."
                                        }
                                    ],
                                    "^enchantments^": "This is the list of enchantments the item will be output with. This is optional."
                                },
                                "^output^": "This is the item that is given to the player when a trade is complete.",

                                "inputA": {
                                    "itemId": "minecraft:gold_ingot",
                                    "meta": 0,
                                    "minStackSize": 2,
                                    "maxStackSize": 11
                                },
                                "^inputA^": "This is the first item that is required to complete the trade.",

                                "inputB": {
                                    "itemId": "minecraft:quartz",
                                    "meta": 0,
                                    "minStackSize": 1,
                                    "maxStackSize": 9
                                },
                                "^inputB^": "This is the second item that is required to complete the trade. This is optional.",

                                "minTradesAvailable": 2,
                                "^minTradesAvailable^": "This is the minimum number of times this trade can be completed before needing to be restocked.",

                                "maxTradesAvailable": 4,
                                "^maxTradesAvailable^": "This is the maximum number of times this trade can be completed before needing to be restocked.",

                                "level": 2,
                                "^level^": "This is the level the pigtificate needs to be to unlock this trade."

                            }
                        ],
                        "^trades^": "This is the list of trades that the Pigtificates can use."
                    }
                ]
            }
        ]
    }
